<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib  prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<c:set var="CP" value="${pageContext.request.contextPath }"/>  
<!DOCTYPE html>
<html>
<head>
<meta charset="${encoding}">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- CSS only -->
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-rbsA2VBKQhggwzxH7pPCaAqO46MgnOM80zW1RWuH61DGLwZJEdK2Kadq2F9CUG65" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="/resources/css/setting/setting_service.css">
<!-- JavaScript Bundle with Popper -->
<script src="https://cdn.jsdelivr.net/npm/bootstrap@5.2.3/dist/js/bootstrap.bundle.min.js" integrity="sha384-kenU1KFdBIe4zVF0s0G1M5b4hcpxyD9F7jL+jjXkk+Q2h455rYXK/7HAuoJl+0I4" crossorigin="anonymous"></script>
<script src="${CP}/resources/js/jquery-3.7.0.js"></script>
<script src="${CP}/resources/js/util.js"></script>
<script src="/resources/js/setting/setting_service.js"></script>
<title>HeNoAIRock</title>
</head>
<body>
<div class="service_enter" id="content">
    <h1>싸그리싺싺 서비스 약관</h1>
    <p>2023년 8월 20일</p>
    <h2>
      <strong>1. 소개</strong>
    </h2>
    <p>
      <strong>관련 약관.</strong> 싸그리싺싺를 사용해 주셔서 감사합니다. 귀하의 싸그리싺싺 사용 및 싸그리싺싺에서
      제공되는 앱(Android 인스턴트 앱 포함), 시스템 서비스, 게임, 영화, 도서, 잡지 또는 기타는 싸그리싺싺의 약관에
      정의된 '서비스'에 해당됩니다.
    </p>
    <h2>
      <strong>2. 싸그리싺싺 사용</strong>
    </h2>
    <p>
      <strong>콘텐츠 액세스 및 사용.</strong> 귀하는 싸그리싺싺를 사용하여 모바일, 컴퓨터, TV, 시계 또는 기타
      지원되는 기기('기기')에서 사용할 콘텐츠를 탐색하거나 찾거나 보거나 스트리밍하거나 다운로드할 수 있습니다. 싸그리싺싺를
      사용하려면 관련 콘텐츠의 시스템 및 호환성 요건을 충족하는 기기, 인터넷 연결, 호환되는 소프트웨어가 필요합니다. 콘텐츠와
      기능의 이용 가능 여부는 국가에 따라 다르며 귀하의 국가에서 일부 콘텐츠나 기능을 이용하지 못할 수도 있습니다. 일부
      콘텐츠는 가족 구성원과 공유할 수 있습니다.
    </p>

    <p>
      <strong>제3자 수수료.</strong> 콘텐츠 및 싸그리싺싺를 사용하거나 보는 데 있어 제3자(인터넷 공급업체 또는
      이동통신사)의 액세스 또는 데이터 수수료와 관련된 책임은 모두 귀하에게 있습니다.
    </p>
    <p>
      <strong>업데이트.</strong> 버그 수정, 향상된 기능, 누락된 플러그인 및 새 버전(통칭하여 '<strong>업데이트</strong>')
      등을 제공받으려면 싸그리싺싺, 관련 지원 라이브러리 또는 콘텐츠를 업데이트해야 하는 경우가 있습니다. 운영진 Play를
      사용하거나 콘텐츠를 액세스, 다운로드 또는 사용하려면 이러한 업데이트가 필요할 수 있습니다. 본 약관에 동의하고 싸그리싺싺를
      사용하면 업데이트 자동 수신에 동의하는 것으로 간주됩니다. 특정 콘텐츠 관련 업데이트는 운영진 Play의 설정을 통해 관리할
      수 있습니다. 하지만 업데이트가 콘텐츠와 관련된 심각한 보안 취약점이나 심각한 운용상 문제를 해결할 수 있거나 악용을 방지할
      수 있다고 판단되는 경우, 싸그리싺싺 또는 기기의 업데이트 설정과 관계없이 업데이트가 실행될 수 있습니다. 다른 앱 스토어가
      싸그리싺싺에서 처음 다운로드한 콘텐츠를 업데이트하려는 경우, 경고 메시지가 표시되거나 업데이트가 완전히 차단될 수 있습니다.
    </p>

    <p>싸그리싺싺에서 가족 그룹에 속해 있는 경우, 가족 그룹 내 다른 가족 구성원이 귀하의 특정 정보를 볼 수
      있습니다. 귀하가 싸그리싺싺에서 가족 그룹 관리자인 경우에는 가족 그룹으로 초대한 가족 구성원이 귀하의 이름, 사진, 이메일
      주소를 볼 수 있습니다. 가족 그룹의 가족 구성원으로 가입하면 다른 구성원이 귀하의 이름, 사진, 이메일 주소를 볼 수
      있습니다. 가족 그룹 관리자는 귀하의 나이를 볼 수도 있으며, 구매한 콘텐츠의 설명을 포함하여 귀하가 지정된 가족 결제
      수단으로 구매한 모든 구매 기록을 볼 수 있습니다. 가족과 공유 가능한 콘텐츠를 가족 그룹과 공유하면 모든 가족 구성원이
      해당 콘텐츠에 액세스하고 귀하가 콘텐츠를 구매한 사실을 알 수 있습니다.</p>
    <p>
      <strong>계정에 대한 무단 액세스.</strong> 본인의 계정 세부정보를 안전하게 보호해야 하며 다른 사람과
      공유해서는 안 됩니다. 계정 이름을 포함하여 싸그리싺싺 사용자 또는 싸그리싺싺를 통해 다른 운영진 서비스를 이용하는 사용자의
      개인정보를 수집해서는 안 됩니다.
    </p>

    <p>
      <strong>멀웨어 차단.</strong> 악의적인 제3자 소프트웨어, URL 및 기타 보안 문제로부터 귀하를 보호하기
      위해 Google은 귀하의 기기에서 네트워크 연결, 잠재적으로 유해한 URL, 운영체제와 싸그리싺싺 또는 다른 출처를 통해
      설치한 앱에 관한 정보를 수신할 수도 있습니다. Google은 앱 또는 URL이 안전하지 않다고 판단하는 경우 경고 메시지를
      표시할 수 있으며, 기기, 데이터, 사용자에게 유해한 것으로 알려진 앱은 기기에서 삭제하거나 설치를 차단할 수 있습니다.
      귀하는 기기의 설정에서 일부 차단 기능을 사용 중지할 수 있습니다. 하지만 이 경우에도 Google은 운영진 Play를 통해
      설치한 앱에 관한 정보를 계속 수신할 수도 있으며, 다른 출처를 통해 기기에 설치된 앱은 보안상 이유로 계속 분석의 대상이
      될 수 있으나, Google에 정보가 전달되지는 않습니다.
    </p>



    <h2>
      <strong>3. 권리 및 제한</strong>
    </h2>
    <p>
      <strong>콘텐츠 사용 라이선스.</strong> 거래를 완료하거나 관련 콘텐츠 수수료를 지불한 이후 귀하는 본 약관 및
      관련 정책에서 명시적으로 허용하는 방식으로만 해당 콘텐츠 사본을 기기에 저장하고 액세스하고 보고 사용하고 표시하거나,
      서비스의 일환으로 승인된 다른 방식으로 개인적, 비상업적 목적에 한해 이용할 수 있는 비독점적인 권한을 갖게 됩니다.
      약관에서 귀하에게 명시적으로 부여하지 않은 싸그리싺싺 및 콘텐츠에 관한 모든 권리, 권한 및 이익은 운영진 또는 제공자의
      소유입니다. 앱 및 게임 사용에는 귀하와 제공자 간에 체결한 최종 사용자 라이선스 계약의 추가 이용약관이 적용될 수
      있습니다.
    </p>
    <p>
      <strong>라이선스 약관의 위반.</strong> 귀하가 약관을 위반하는 경우 본 라이선스에 따른 귀하의 권리는 효력을
      상실합니다.
    </p>
    <p>
      <strong>제한</strong>: 다음과 같은 제한 사항을 준수해야 합니다.
    </p>
    <ul>
      <li>요금이 청구되지 않는 경우에도 콘텐츠의 전체 또는 일부를 공연 또는 전시의 일환으로 표시해서는 안 됩니다.
        단 (a) 이러한 사용이 저작권 침해를 구성하거나 다른 관련 권리를 위반하지 않거나 (b) 명시적으로 허가되고 지정된
        방식을 정확히 따르는 경우에는 제외됩니다.</li>
    </ul>
    <ul>
      <li>싸그리싺싺를 통해 취득한 콘텐츠의 다운로드를 포함하여 콘텐츠를 제3자에게 판매, 임대, 대여, 재배포,
        방송, 전송, 전달, 수정, 라이선스 재판매, 이전 또는 양도할 수 없습니다. 단 명시적으로 허가되고 지정된 방식을 정확히
        따르는 경우에는 예외로 간주됩니다.</li>
    </ul>
    <ul>
      <li>스트림 리핑, 스트림 캡처 또는 스트리밍 형식으로 제공되는 콘텐츠를 기록하거나 사본을 만드는 유사한
        소프트웨어와 연계하여 싸그리싺싺나 콘텐츠를 사용해서는 안 됩니다.</li>
    </ul>
    <ul>
      <li>콘텐츠를 공유, 대여, 다자 사용 또는 기타 기관의 목적을 위한 서비스의 일부로 사용할 수 없습니다. 단
        명시적으로 허가되고 지정된 방식을 정확히 따르는 경우에는 예외로 간주됩니다.</li>
    </ul>
    <ul>
      <li>콘텐츠 또는 싸그리싺싺에 대한 액세스 권한을 보호, 난독화 또는 제한하는 보안 기능이나 구성요소를 우회,
        사용 중지 또는 파기하도록 시도하거나 다른 사용자에게 그러한 행위를 하도록 지원, 승인 또는 권장해서는 안 됩니다.</li>
    </ul>
    <ul>
      <li>콘텐츠에 포함된 워터마크, 라벨, 기타 법적 또는 독점 권리 고지를 삭제하거나, 콘텐츠의 소유권 또는 출처
        표시를 위장하거나 변경할 목적의 수정을 포함하여 싸그리싺싺를 통해 얻은 콘텐츠를 수정하려 해서는 안 됩니다.</li>
    </ul>
    <p>
      <strong>제3자 조항.</strong> 본 약관의 반대되는 조항에도 불구하고 콘텐츠 사용 라이선스를 싸그리싺싺에
      부여하는 제3자는 자신의 콘텐츠와 직접 관련된 본 약관의 구체적인 조항('<strong>제3자 조항</strong>')에
      한정하여 제3자가 이러한 콘텐츠에 관해 자신의 권리를 행사하도록 하기 위한 목적으로만 본 약관에 의거한 제3자 수혜자로
      간주됩니다. 의심의 소지를 없애기 위해 본 약관의 어느 조항도 제3자 조항에 속하지 않는 조항과 관련하여 제3의 수혜자
      권리를 어느 당사자에게도 부여하지 않으며, 여기에는 본 약관에 참조를 통해 포함되거나 포함되지 않고 참조된 조항 및 계약이
      해당되지만 이에 국한되지는 않습니다.
    </p>



    <p>
      <strong>여러 개의 계정.</strong> 사용자 이름이 다른 운영진 계정을 여러 개 갖고 있으면, 한 계정의 콘텐츠를
      다른 계정으로 이전하는 것은 귀하가 각 계정들의 소유자입니다.
    </p>

    <p>
      <strong>위험한 활동.</strong> 어떠한 서비스 또는 콘텐츠도 핵 시설, 생명 유지 장치, 비상 통신, 항공 항법
      또는 통신 시스템, 항공 교통 관제 시스템의 운영에 사용되거나 서비스 또는 콘텐츠 오류로 인해 사망, 신체적 상해, 심각한
      물리적 또는 환경적 손상으로 이어질 수 있는 기타 다른 활동에 사용할 수 없습니다.
    </p>
</body>
</html>